var win = Ti.UI.currentWindow;

var aboutImage = Ti.UI.createImageView({
  url: '../../images/bg/bg-dark.png'
});
win.add(aboutImage);

Ti.App.addEventListener("openURL", function (e) {
  Ti.Platform.openURL(e.url);
});

var  html = "<html><body style='padding: 10px; font-size: 14px; color: #fff; font-family: sans-serif;'>" +
"<p>Податоците за проблемот кои ги испраќате, вклучувајќи ја локацијата ќе бидат јавни податоци, видливи на <a href=\"javascript:Ti.App.fireEvent('openURL', {url: 'http://popravi.mk/'});\" style='color: #EE9200; font-weight: bold;'>popravi.mk</a>. Важно е да имате вклучен GPS на мобилниот уред, интернет конекција и проблемите да ги пријавувате од вистинско место бидејќки за локација на проблемот се земаат координатите од каде е пријавен истиот.</p>" +
"<p>Проблеми може да пријавувате анонимно или со ваша адреса за електронска пошта. Доколку се идентификувате со ваша адреса и подоцна се регистрирате со истата на веб апликацијата од овој сервис, ќе можете од таму да ги изменувате вашите пријавени проблеми.</p>" +
"<p>Забрането е да се изложувате себе и животната средина на опасност при пријавување на проблеми. Ве молиме критичните информации пријавете ги директно на надлежните органи.</p>" +
"<p>Забрането е да пријавувате материјал кој е лажен, клеветнички, злоупотребен, вулгарен, полн со омраза (расна, национална, полова, културна или лична).</p>" +
"<p>PopraviMK се обврзува да ја почитува приватноста и анонимноста на своите членови и гарантира дека вашите податоци нема да ги посредува на трети лица.</p>" +
"<p>Доколку при користење на оваа апликација се прекршени условите за користење и се повредени локалните закони, доколку е потребно, одговорните лица ќе соработуваат со сите правни институции, откривајќи ги сите потребни информации на прекршителот (IP адреса, електронска пошта).</p>" +
"<p>Повеќе инфо на info@popravi.mk.</p>" +
'</body></html>';

var webView = Ti.UI.createWebView({
  top: 25, left: 0, 
  backgroundColor: 'transparent', 
  html: html
});

win.add(webView);
